<html>
<head>
<title>Practica de Git</title>
</head>
<body><h1>Empezando - Acerca del control de versiones</h1>
<h2>Acerca del control de versiones</h2>
<p>¿Qu&eacute; es el control de versiones, y por qu&eacute; deber&iacute;a importarte? El control de versiones es un sistema que registra los cambios realizados sobre un archivo o conjunto de archivos a lo largo del tiempo, de modo que puedas recuperar versiones espec&iacute;ficas m&aacute;s adelante. A pesar de que los ejemplos de este libro muestran c&oacute;digo fuente como archivos bajo control de versiones, en realidad cualquier tipo de archivo que encuentres en un ordenador puede ponerse bajo control de versiones.</p>

<p>Si eres dise&ntilde;ador gr&aacute;fico o web, y quieres mantener cada versi&oacute;n de una imagen o dise&ntilde;o (algo que sin duda quieres), un sistema de control de versiones (Version Control System o VCS en ingl&eacute;s) es una elecci&oacute;n muy sabia. Te permite revertir archivos a un estado anterior, revertir el proyecto entero a un estado anterior, comparar cambios a lo largo del tiempo, ver qui&eacute;n modific&oacute; por última vez algo que puede estar causando un problema, qui&eacute;n introdujo un error y cu&aacute;ndo, y mucho m&aacute;s. Usar un VCS tambi&eacute;n significa generalmente que si fastidias o pierdes archivos, puedes recuperarlos f&aacute;cilmente. Adem&aacute;s, obtienes todos estos beneficios a un coste muy bajo.</p>

<h2>Sistemas de control de versiones locales</h2>
<p>Un m&eacute;todo de control de versiones usado por mucha gente es copiar los archivos a otro directorio (quiz&aacute;s indicando la fecha y hora en que lo hicieron, si son avispados). Este enfoque es muy común porque es muy simple, pero tambi&eacute;n tremendamente propenso a errores. Es f&aacute;cil olvidar en qu&eacute; directorio te encuentras, y guardar accidentalmente en el archivo equivocado o sobrescribir archivos que no quer&iacute;as.</p>

<p>Para hacer frente a este problema, los programadores desarrollaron hace tiempo VCSs locales que conten&iacute;an una simple base de datos en la que se llevaba registro de todos los cambios realizados sobre los archivos (v&eacute;ase Figura 1-1).</p>

<img src="imagenes/cvs.png" width=600/>
</body>
</html>